{
  "main": {
    "name": "Venu Nalla",
    "occupation": "UI Developer",
    "description": "ReactJS and Angular Developer",
    "image": "venu.jpg",
    "bio": "With 7+ years of development experience, I am skilled in HTML5, CSS3, JavaScript, jQuery, AJAX, NodeJS, AngularJS, Angular2/4/6/10/12, ReactJS, Redux tool Kit and React Native. I have experience in implementing AJAX features using JavaScript and jQuery, as well as in building user interfaces and SPAs using ReactJS and defining Angular routes using Router Module. Additionally, I have extensive experience in cloud-based projects using platforms such as Amazon Web Services (AWS) and Microsoft Azure. Throughout my career, I have been involved in all stages of the Software Development Life Cycle and Product Life Cycle Management, and have strong communication, planning, and problem-solving skills.",
    "contactmessage": "Get in touch with me to know more details about me.",
    "email": "Venu7731@gmail.com",
    "phone": "+17706094996",
    "address": {
      "street": "Barkley street",
      "city": "Overland Park",
      "state": "Kansas",
      "zip": "66223"
    },
    "website": "https://drive.google.com/file/d/1ILor1EGHzMubKkaNe6sidzb0I1g7Kvfw/view?usp=sharing",
    "resumedownload": "https://docs.google.com/document/d/1CVTe5quHG6T4y3vHQ_c9e7OyoP_Y5Hu6/edit?usp=sharing&ouid=107761549918407177970&rtpof=true&sd=true",
    "className": "fa fa-envelope-open-o",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/venu-n-327b09192",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/venunalla7731",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here is additional information.",
    "education": [
      {
        "school": "University of Central Missouri, Warrensburg, MO, USA",
        "degree": "Master's in Science",
        "graduated": "May 2015",
        "description": "Computer Information Systems"
      },
      {
        "school": "Jawaharlal Nehru Technological University Hyderabad",
        "degree": "Bachelor of technology",
        "graduated": "May 2013",
        "description": "computer science and engineering"
      }
    ],
    "work": [
      {
        "company": "H&R Block ",
        "title": "Java UI Developer",
        "years": "Nov 2020- Till now",
        "description": "As a part of the Chrysalis Microsites project, I created and implemented visual style guides in accordance with H&R Block's visual identity, using Angular. I also enabled web analytics tools such as Adobe Analytics (AEM) to optimize the performance of the microsites. Additionally, I contributed to the development of H&R Block's mobile banking platform, Spruce, using ReactJS and was responsible for handling the Digital Drop-off (DDO) and Financial Services Product (FSP) processes as part of the Virtual Submissions project."
      },
      {
        "company": "Wells Fargo",
        "title": "Java UI Developer ",
        "years": "Nov 2018 - Nov 2020",
        "description": "The project, which was built using React, focuses on payment methods through ACH (automated clearing house) and wire transfers. Funds are transferred from one account to another through either a direct wire transfer between the sender and recipient accounts or an ACH transfer, where the automated clearing house acts as an intermediary."
      },
      {
        "company": "CVS Health ",
        "title": "UI Developer",
        "years": "Jan 2018 - Nov 2018",
        "description": "The Specialty Process and Productivity (SPP) project is a redesign of the legacy application SPARCS, which stands for the Specialty Pharmacy Account Receivable Computer System. The aim of SPARCS is to provide users with a system to create and submit invoices for billing, apply payments to charges, and manage patient accounts effectively. The SPP project is aimed at modernizing and improving the functionality of this existing system."
      },
      {
        "company": "Sprint Corporation ",
        "title": "UI Developer",
        "years": "Jan 2017 - Jan 2018",
        "description": "I worked on the E-Payment system, a multi-tier electronic payment solution that allows sub-layers to make payments on behalf of customers or set up recurring automatic payments for a customer's Sprint bill directly from the web. These recurring payments can only be made using a customer's credit card, and both customers and sales representatives have access to the payment system data."
      },
      {
        "company": "Facebook, Inc. ",
        "title": "UI Developer",
        "years": "Sep 2016 - Jan 2017",
        "description": "Responsible for designing and implementing a Facebook Blueprint, a technical resource offering self-paced and step-by-step tutorials on various digital marketing concepts and strategies. The tutorials were designed to help individuals build their digital marketing knowledge, improve their skills, and bring their business online effectively."
      },
      {
        "company": "Apple. Inc. ",
        "title": "UI Developer",
        "years": "Dec 2015 - Sep 2016",
        "description": "The aim of the project was to develop a web-based online application where the Internal Employees can access their account details like the account information, Commute info, punch in and punch out schedules. They can view details of current balances, account statements for a specific period of day, hour’s history, checks history, address information online."
      },
      {
        "company": "Chico's FAS Inc ",
        "title": "Front End Developer / Internship ",
        "years": "July 2015 - Dec 2015",
        "description": "Oversaw and creating, implementing and developing new applications and Brand websites which included new interface and dynamic pages for Chico’s production website Involved in managing project in digital and e-commerce by adding transactional UI frames and  payment methods."
      }
    ],
    "skills": [
      {
        "name": "ReactJs",
        "level": "95%"
      },
      {
        "name": "CSS3",
        "level": "100%"
      },
      {
        "name": "Git",
        "level": "100%"
      },
      {
        "name": "Angular",
        "level": "85%"
      },
      {
        "name": "HTML5",
        "level": "100%"
      },
      {
        "name": "TypeScript",
        "level": "90%"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Venu was a lead developer for a high-profile, fast-tracked IT project that involved business segments beyond our team. Venu made himself available around the clock to troubleshoot and collaborate with onshore and offshore development teams. Venu is highly capable and extremely engaging within a cross-funtional team structure; waterfall and pseudo-Agile run experience. His skillset and expertise helped me get a project from red to green and successfully released on time and budget. I highly recommend Venu!",
        "user": "John Winegarden, CSM, ICP"
      },
      {
        "text": "Venu is an excellent Front End Engineer. We worked together at Wells Fargo in the same team for two years. He is extremely methodical and thorough.His grasp of various front end technologies allows him to explore a plethora of possible solutions to any given problem. His innate ability to learn and adapt to new things quickly makes him a sought-after team member !",
        "user": "Ashish Korpe"
      }
    ]
  }
}